Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindingType
Enumeration type to indicate whether extended properties should be bound to instances or types.
Since:
2027
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindingType.Type
Extended properties should be bound to type.

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesBindingType.Instance
Extended properties should be bound to instance.